mafaneh/ble-ebook-project/nRF5_SDK_current/examples/crypto/nrf_crypto/cli/cmd_ecc.c
/**
 * Copyright (c) 2018, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdint.h>
#include <stdbool.h>

#include "nrf_cli.h"
#include "vars.h"
#include "raw.h"
#include "cli_utils.h"
#include "nrf_crypto_ecc.h"
#include "nrf_crypto_ecdh.h"
#include "nrf_crypto_ecdsa.h"
#include "nrf_crypto_eddsa.h"


/* =============================================================================================
 *                           Curve name utility functions
 * =============================================================================================
 */


typedef struct
{
    nrf_crypto_ecc_curve_info_t const * p_info;
    char                        const * p_name;
} curve_info_name_t;


static const curve_info_name_t m_curve_info_name_table[] =
{
#if NRF_CRYPTO_ECC_BP256R1_ENABLED
    { &g_nrf_crypto_ecc_bp256r1_curve_info, "bp256r1" },
#endif
#if NRF_CRYPTO_ECC_BP384R1_ENABLED
    { &g_nrf_crypto_ecc_bp384r1_curve_info, "bp384r1" },
#endif
#if NRF_CRYPTO_ECC_BP512R1_ENABLED
    { &g_nrf_crypto_ecc_bp512r1_curve_info, "bp512r1" },
#endif
#if NRF_CRYPTO_ECC_CURVE25519_ENABLED
    { &g_nrf_crypto_ecc_curve25519_curve_info, "curve25519" },
#endif
#if NRF_CRYPTO_ECC_ED25519_ENABLED
    { &g_nrf_crypto_ecc_ed25519_curve_info, "ed25519" },
#endif
#if NRF_CRYPTO_ECC_SECP160K1_ENABLED
    { &g_nrf_crypto_ecc_secp160k1_curve_info, "secp160k1" },
#endif
#if NRF_CRYPTO_ECC_SECP160R1_ENABLED
    { &g_nrf_crypto_ecc_secp160r1_curve_info, "secp160r1" },
#endif
#if NRF_CRYPTO_ECC_SECP160R2_ENABLED
    { &g_nrf_crypto_ecc_secp160r2_curve_info, "secp160r2" },
#endif
#if NRF_CRYPTO_ECC_SECP192K1_ENABLED
    { &g_nrf_crypto_ecc_secp192k1_curve_info, "secp192k1" },
#endif
#if NRF_CRYPTO_ECC_SECP192R1_ENABLED
    { &g_nrf_crypto_ecc_secp192r1_curve_info, "secp192r1" },
#endif
#if NRF_CRYPTO_ECC_SECP224K1_ENABLED
    { &g_nrf_crypto_ecc_secp224k1_curve_info, "secp224k1" },
#endif
#if NRF_CRYPTO_ECC_SECP224R1_ENABLED
    { &g_nrf_crypto_ecc_secp224r1_curve_info, "secp224r1" },
#endif
#if NRF_CRYPTO_ECC_SECP256K1_ENABLED
    { &g_nrf_crypto_ecc_secp256k1_curve_info, "secp256k1" },
#endif
#if NRF_CRYPTO_ECC_SECP256R1_ENABLED
    { &g_nrf_crypto_ecc_secp256r1_curve_info, "secp256r1" },
#endif
#if NRF_CRYPTO_ECC_SECP384R1_ENABLED
    { &g_nrf_crypto_ecc_secp384r1_curve_info, "secp384r1" },
#endif
#if NRF_CRYPTO_ECC_SECP521R1_ENABLED
    { &g_nrf_crypto_ecc_secp521r1_curve_info, "secp521r1" },
#endif
    { NULL, NULL },
};


static nrf_crypto_ecc_curve_info_t const * curve_info_get(char const * p_name)
{
    curve_info_name_t const * item = &m_curve_info_name_table[0];
    while (item->p_info)
    {
        if (strcmp(p_name, item->p_name) == 0)
        {
            return item->p_info;
        }
        item++;
    }
    nrf_cli_fprintf(cli_get(),
                    NRF_CLI_WARNING,
                    "Invalid curve name '%s'. Available curves:\r\n",
                    p_name);
    item = &m_curve_info_name_table[0];
    while (item->p_info)
    {
        nrf_cli_fprintf(cli_get(), NRF_CLI_INFO, "  %s\r\n", item->p_name);
        item++;
    }
    return NULL;
}


static char const * curve_name_get(nrf_crypto_ecc_curve_info_t const * p_info)
{
    curve_info_name_t const * item = &m_curve_info_name_table[0];
    while (item->p_info)
    {
        if (p_info == item->p_info)
        {
            return item->p_name;
        }
        item++;
    }
    return "INVALID";
}


/* =============================================================================================
 *                           Sub commands used in arguments
 * =============================================================================================
 */


static void subcmd_curve_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    p_static->p_syntax = m_curve_info_name_table[idx].p_name;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = NULL;
}


VAR_REGISTER_SUB_COMMANDS(m_subcmd_var, NULL);
VAR_REGISTER_SUB_COMMANDS(m_subcmd_var_var, &m_subcmd_var);
VAR_REGISTER_SUB_COMMANDS(m_subcmd_var_var_var, &m_subcmd_var_var);
CLI_CREATE_DYNAMIC_CMD_WITH_SUBCMD(m_subcmd_curve_var, subcmd_curve_get, &m_subcmd_var);
CLI_CREATE_DYNAMIC_CMD_WITH_SUBCMD(m_subcmd_curve_var_var, subcmd_curve_get, &m_subcmd_var_var);
NRF_CLI_CREATE_DYNAMIC_CMD(m_subcmd_curve, subcmd_curve_get);


/* =============================================================================================
 *                               ECC CLI types definition
 * =============================================================================================
 */


static void ecc_key_print(var_t * p_var, bool short_info)
{
    ret_code_t                          ret;
    char                        const * p_name;
    nrf_crypto_ecc_curve_info_t const * p_info = NULL;

    ret = nrf_crypto_ecc_curve_info_get(VAR_DATA(p_var), &p_info);
    cli_error_print(ret);
    p_name = curve_name_get(p_info);

    if (short_info)
    {
        nrf_cli_fprintf(cli_get(), NRF_CLI_NORMAL, "Curve %s.", p_name);
    }
}


static bool ecc_private_key_free(var_t * p_var)
{
    ret_code_t ret;
    ret = nrf_crypto_ecc_private_key_free((nrf_crypto_ecc_private_key_t *)VAR_DATA(p_var));
    cli_error_print(ret);
    return true;
}


static void ecc_private_key_print(var_t * p_var, bool short_info)
{
    ecc_key_print(p_var, short_info);

