mafaneh/ble-ebook-project/nRF5_SDK_current/examples/crypto/nrf_crypto/cli/cmd_ecc.c
    if (!short_info)
    {
        ret_code_t                         ret;
        nrf_crypto_ecc_private_key_t     * p_pub;
        nrf_crypto_ecc_raw_private_key_t   raw;
        size_t                             size;

        p_pub = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_var);

        size = sizeof(raw);
        ret = nrf_crypto_ecc_private_key_to_raw(p_pub, raw, &size);

        if (ret == NRF_SUCCESS)
        {
            nrf_cli_fprintf(cli_get(), NRF_CLI_NORMAL, "Raw form:\r\n");
            raw_print_hex(raw, size);
        }
        else if (ret != NRF_ERROR_CRYPTO_FEATURE_UNAVAILABLE)
        {
            cli_error_print(ret);
        }
    }
}


static const var_type_t m_ecc_private_key_type =
{
    .p_description = "ECC Private Key",
    .free_fn       = ecc_private_key_free,
    .print_fn      = ecc_private_key_print,
    .p_tag         = NULL,
};


static bool ecc_public_key_free(var_t * p_var)
{
    ret_code_t ret;
    ret = nrf_crypto_ecc_public_key_free((nrf_crypto_ecc_public_key_t *)VAR_DATA(p_var));
    cli_error_print(ret);
    return true;
}


static void ecc_public_key_print(var_t * p_var, bool short_info)
{
    ecc_key_print(p_var, short_info);

    if (!short_info)
    {
        ret_code_t                        ret;
        nrf_crypto_ecc_public_key_t     * p_pub;
        nrf_crypto_ecc_raw_public_key_t   raw;
        size_t                            size;

        p_pub = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_var);

        size = sizeof(raw);
        ret = nrf_crypto_ecc_public_key_to_raw(p_pub, raw, &size);

        if (ret == NRF_SUCCESS)
        {
            nrf_cli_fprintf(cli_get(), NRF_CLI_NORMAL, "Raw form:\r\n");
            raw_print_hex(raw, size);
        }
        else if (ret != NRF_ERROR_CRYPTO_FEATURE_UNAVAILABLE)
        {
            cli_error_print(ret);
        }
    }
}


static const var_type_t m_ecc_public_key_type =
{
    .p_description = "ECC Public Key",
    .free_fn       = ecc_public_key_free,
    .print_fn      = ecc_public_key_print,
    .p_tag         = NULL,
};


/* =============================================================================================
 *                               ECC Key generation commands
 * =============================================================================================
 */


/** @brief Command to generate key pair. See command help for details.
 */
static bool cmd_ecc_key_pair_generate(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                           ret;
    var_t                              * p_prv_var;
    var_t                              * p_pub_var;
    nrf_crypto_ecc_curve_info_t  const * p_info;
    nrf_crypto_ecc_private_key_t       * p_prv;
    nrf_crypto_ecc_public_key_t        * p_pub;

    UNUSED_PARAMETER(p_cli);

    CLI_ARGS_CHECK(argc == 4);

    p_info = curve_info_get(argv[1]);
    CLI_CHECK(p_info != NULL);

    p_prv_var = cli_output_arg_get(2, &m_ecc_private_key_type, p_info->private_key_size);
    p_pub_var = cli_output_arg_get(3, &m_ecc_public_key_type, p_info->public_key_size);
    CLI_CHECK((p_prv_var != NULL) && (p_pub_var != NULL));

    p_prv = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_prv_var);
    p_pub = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_pub_var);

    ret = nrf_crypto_ecc_key_pair_generate(NULL, p_info, p_prv, p_pub);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(ecc_key_pair_generate, &m_subcmd_curve, cmd_ecc_key_pair_generate,
    "Generate ECC key pair.\r\n"
    "Usage:\r\n"
    "  ecc_key_pair_generate curve private_key public_key\r\n"
    "Arguments:\r\n"
    "  IN  curve        Curve to use.\r\n"
    "  IN  private_key  Source private key.\r\n"
    "  OUT public_key   Generated public key.\r\n"
    );


/** @brief Command to calculate public key from private key. See command help for details.
 */
static bool cmd_ecc_public_key_calculate(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                           ret;
    var_t                              * p_prv_var;
    var_t                              * p_pub_var;
    nrf_crypto_ecc_curve_info_t  const * p_info;
    nrf_crypto_ecc_private_key_t       * p_prv;
    nrf_crypto_ecc_public_key_t        * p_pub;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 3);

    p_prv_var = cli_input_arg_get(1, &m_ecc_private_key_type);
    CLI_CHECK(p_prv_var != NULL);

    p_prv = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_prv_var);

    ret = nrf_crypto_ecc_curve_info_get(p_prv, &p_info);
    CLI_ERROR_CHECK(ret);

    p_pub_var = cli_output_arg_get(2, &m_ecc_public_key_type, p_info->public_key_size);
    CLI_CHECK(p_pub_var != NULL);

    p_pub = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_pub_var);

    ret = nrf_crypto_ecc_public_key_calculate(NULL, p_prv, p_pub);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(ecc_public_key_calculate, &m_subcmd_var, cmd_ecc_public_key_calculate,
    "Generate ECC public key from private key.\r\n"
    "Usage:\r\n"
    "  ecc_public_key_calculate private_key public_key\r\n"
    "Arguments:\r\n"
    "  IN  private_key  Source private key.\r\n"
    "  OUT public_key   Generated public key\r\n"
    );


/** @brief Command to list all ECC curves types. See command help for details.
 */
static bool cmd_ecc_curves(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    curve_info_name_t const * item = &m_curve_info_name_table[0];

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 1);

    while (item->p_info)
    {
        nrf_cli_fprintf(cli_get(), NRF_CLI_NORMAL, "%s\r\n", item->p_name);
        item++;
    }

    return true;
}


CLI_CMD_REGISTER(ecc_curves, NULL, cmd_ecc_curves,
    "Show all available ECC curve types.\r\n"
    "Usage:\r\n"
    "  ecc_curves\r\n"
    );


/* =============================================================================================
 *                               ECC Key conversion commands
 * =============================================================================================
 */


/** @brief Command to convert public key from raw data. See command help for details.
 */
static bool cmd_ecc_public_key_from_raw(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                          ret;
    nrf_crypto_ecc_curve_info_t const * p_info;
    var_t                             * p_raw_var;
    var_t                             * p_key_var;

    UNUSED_PARAMETER(p_cli);

    CLI_ARGS_CHECK(argc == 4);

    p_info = curve_info_get(argv[1]);
    CLI_CHECK(p_info != NULL);

    p_raw_var = cli_input_arg_get(2, &g_raw_type);
    p_key_var = cli_output_arg_get(3, &m_ecc_public_key_type, p_info->public_key_size);
    CLI_CHECK((p_raw_var != NULL) && (p_key_var != NULL));

    ret = nrf_crypto_ecc_public_key_from_raw(p_info,
                                             (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_key_var),
                                             VAR_DATA(p_raw_var),
                                             p_raw_var->data_size);
    CLI_ERROR_CHECK(ret);

