mafaneh/ble-ebook-project/nRF5_SDK_current/examples/crypto/nrf_crypto/cli/cmd_ecc.c
    return true;
}


CLI_CMD_REGISTER(ecc_public_key_from_raw, &m_subcmd_curve_var, cmd_ecc_public_key_from_raw,
    "Create ECC public key from raw data.\r\n"
    "Usage:\r\n"
    "  ecc_public_key_from_raw curve raw_data public_key\r\n"
    "Arguments:\r\n"
    "  IN  curve        Curve name. Command 'ecc_curves' lists all supported curves.\r\n"
    "  IN  raw_data     Raw representation of the key\r\n"
    "  OUT public_key   Converted key\r\n"
    );


/** @brief Command to convert private key from raw data. See command help for details.
 */
static bool cmd_ecc_private_key_from_raw(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                          ret;
    nrf_crypto_ecc_curve_info_t const * p_info;
    var_t                             * p_raw_var;
    var_t                             * p_key_var;

    UNUSED_PARAMETER(p_cli);

    CLI_ARGS_CHECK(argc == 4);

    p_info = curve_info_get(argv[1]);
    CLI_CHECK(p_info != NULL);

    p_raw_var = cli_input_arg_get(2, &g_raw_type);
    p_key_var = cli_output_arg_get(3, &m_ecc_private_key_type, p_info->private_key_size);
    CLI_CHECK((p_raw_var != NULL) && (p_key_var != NULL));

    ret = nrf_crypto_ecc_private_key_from_raw(p_info,
                                              (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_key_var),
                                              VAR_DATA(p_raw_var),
                                              p_raw_var->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(ecc_private_key_from_raw, &m_subcmd_curve_var, cmd_ecc_private_key_from_raw,
    "Create ECC private key from raw data.\r\n"
    "Usage:\r\n"
    "  ecc_private_key_from_raw curve raw_data private_key\r\n"
    "Arguments:\r\n"
    "  IN  curve        Curve name. Command 'ecc_curves' lists all supported curves.\r\n"
    "  IN  raw_data     Raw representation of the key\r\n"
    "  OUT private_key  Converted key\r\n"
    );


/** @brief Command to convert public key to raw data. See command help for details.
 */
static bool cmd_ecc_public_key_to_raw(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                           ret;
    var_t                              * p_raw_var;
    var_t                              * p_key_var;
    nrf_crypto_ecc_curve_info_t  const * p_info;
    nrf_crypto_ecc_public_key_t        * p_key;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 3);

    p_key_var = cli_input_arg_get(1, &m_ecc_public_key_type);
    CLI_CHECK(p_key_var != NULL);

    p_key = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_key_var);

    ret = nrf_crypto_ecc_curve_info_get(p_key, &p_info);
    CLI_ERROR_CHECK(ret);

    p_raw_var = cli_output_arg_get(2, &g_raw_type, p_info->raw_public_key_size);
    CLI_CHECK(p_raw_var != NULL);

    ret = nrf_crypto_ecc_public_key_to_raw(p_key, VAR_DATA(p_raw_var), &p_raw_var->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(ecc_public_key_to_raw, &m_subcmd_var, cmd_ecc_public_key_to_raw,
    "Get raw data from ECC public key.\r\n"
    "Usage:\r\n"
    "  ecc_public_key_to_raw public_key raw_data\r\n"
    "Arguments:\r\n"
    "  IN  public_key   Key to convert\r\n"
    "  OUT raw_data     Raw representation of the key\r\n"
    );


/** @brief Command to convert private key to raw data. See command help for details.
 */
static bool cmd_ecc_private_key_to_raw(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                           ret;
    var_t                              * p_raw_var;
    var_t                              * p_key_var;
    nrf_crypto_ecc_curve_info_t  const * p_info;
    nrf_crypto_ecc_private_key_t       * p_key;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 3);

    p_key_var = cli_input_arg_get(1, &m_ecc_private_key_type);
    CLI_CHECK(p_key_var != NULL);

    p_key = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_key_var);

    ret = nrf_crypto_ecc_curve_info_get(p_key, &p_info);
    CLI_ERROR_CHECK(ret);

    p_raw_var = cli_output_arg_get(2, &g_raw_type, p_info->raw_private_key_size);
    CLI_CHECK(p_raw_var != NULL);

    ret = nrf_crypto_ecc_private_key_to_raw(p_key, VAR_DATA(p_raw_var), &p_raw_var->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(ecc_private_key_to_raw, &m_subcmd_var, cmd_ecc_private_key_to_raw,
    "Get raw data from ECC private key.\r\n"
    "Usage:\r\n"
    "  ecc_private_key_to_raw private_key raw_data\r\n"
    "Arguments:\r\n"
    "  IN  private_key  Key to convert\r\n"
    "  OUT raw_data     Raw representation of the key\r\n"
    );


/* =============================================================================================
 *                                    ECDH Commands
 * =============================================================================================
 */


/** @brief Command to compute ECDH. See command help for details.
 */
static bool cmd_ecdh_compute(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                        ret;
    var_t                           * p_prv_var;
    var_t                           * p_pub_var;
    var_t                           * p_shared_secret_var;
    nrf_crypto_ecc_private_key_t    * p_prv;
    nrf_crypto_ecc_public_key_t     * p_pub;
    nrf_crypto_ecdh_shared_secret_t   shared_secret;
    size_t                            size;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 4);

    p_prv_var = cli_input_arg_get(1, &m_ecc_private_key_type);
    p_pub_var = cli_input_arg_get(2, &m_ecc_public_key_type);
    CLI_CHECK((p_prv_var != NULL) && (p_pub_var != NULL));

    p_prv = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_prv_var);
    p_pub = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_pub_var);

    size = sizeof(shared_secret);
    ret  = nrf_crypto_ecdh_compute(NULL, p_prv, p_pub, shared_secret, &size);
    CLI_ERROR_CHECK(ret);

    p_shared_secret_var = cli_output_arg_get(3, &g_raw_type, size);
    CLI_CHECK(p_shared_secret_var != NULL);

    memcpy(VAR_DATA(p_shared_secret_var), shared_secret, size);

