mafaneh/ble-ebook-project/nRF5_SDK_current/examples/crypto/nrf_crypto/cli/cmd_ecc.c
    return true;
}


CLI_CMD_REGISTER(ecdh_compute, &m_subcmd_var_var, cmd_ecdh_compute,
    "Compute Elliptic-curve Diffie-Hellman shared secret.\r\n"
    "Usage:\r\n"
    "  ecdh_compute private_key public_key shared_secret\r\n"
    "Arguments:\r\n"
    "  IN  private_key   Local private key\r\n"
    "  IN  public_key    Remote public key\r\n"
    "  OUT shared_secret Created shared secret\r\n"
    );


/* =============================================================================================
 *                                   ECDSA Commands
 * =============================================================================================
 */


/** @brief Command to sign with ECDSA. See command help for details.
 */
static bool cmd_ecdsa_sign(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                     ret;
    var_t                        * p_prv_var;
    var_t                        * p_hash_var;
    var_t                        * p_signature_var;
    nrf_crypto_ecc_private_key_t * p_key;
    nrf_crypto_ecdsa_signature_t   signature;
    size_t                         size;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 4);

    p_prv_var  = cli_input_arg_get(1, &m_ecc_private_key_type);
    p_hash_var = cli_input_arg_get(2, &g_raw_type);
    CLI_CHECK((p_prv_var != NULL) && (p_hash_var != NULL));

    p_key = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_prv_var);

    size = sizeof(signature);
    ret  = nrf_crypto_ecdsa_sign(NULL,
                                 p_key,
                                 VAR_DATA(p_hash_var),
                                 p_hash_var->data_size,
                                 signature,
                                 &size);
    CLI_ERROR_CHECK(ret);

    p_signature_var = cli_output_arg_get(3, &g_raw_type, size);
    CLI_CHECK(p_signature_var != NULL);

    memcpy(VAR_DATA(p_signature_var), signature, size);

    return true;
}


CLI_CMD_REGISTER(ecdsa_sign, &m_subcmd_var_var, cmd_ecdsa_sign,
    "Sign a message with ECC private key.\r\n"
    "Usage:\r\n"
    "  ecdsa_sign private_key hash signature\r\n"
    "Arguments:\r\n"
    "  IN  private_key  Private key\r\n"
    "  IN  hash         Hash of the message to sign\r\n"
    "  OUT signature    Signature to create\r\n"
    );


/** @brief Command to verify with ECDSA. See command help for details.
 */
static bool cmd_ecdsa_verify(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                    ret;
    var_t                       * p_pub_var;
    var_t                       * p_hash_var;
    var_t                       * p_signature_var;
    nrf_crypto_ecc_public_key_t * p_key;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 4);

    p_pub_var       = cli_input_arg_get(1, &m_ecc_public_key_type);
    p_hash_var      = cli_input_arg_get(2, &g_raw_type);
    p_signature_var = cli_input_arg_get(3, &g_raw_type);
    CLI_CHECK((p_pub_var != NULL) && (p_hash_var != NULL) && (p_signature_var != NULL));

    p_key = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_pub_var);

    ret = nrf_crypto_ecdsa_verify(NULL,
                                  p_key,
                                  VAR_DATA(p_hash_var),
                                  p_hash_var->data_size,
                                  VAR_DATA(p_signature_var),
                                  p_signature_var->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(ecdsa_verify, &m_subcmd_var_var_var, cmd_ecdsa_verify,
    "Verify a hash with ECC public key.\r\n"
    "Usage:\r\n"
    "  ecdsa_verify public_key hash signature\r\n"
    "Arguments:\r\n"
    "  IN  public_key   Public key\r\n"
    "  IN  hash         Hash of the message to verify\r\n"
    "  IN  signature    Signature to check\r\n"
    );


/* =============================================================================================
 *                                   EdDSA Commands
 * =============================================================================================
 */


/** @brief Command to sign with EdDSA. See command help for details.
 */
static bool cmd_eddsa_sign(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                     ret;
    var_t                        * p_prv_var;
    var_t                        * p_message_var;
    var_t                        * p_signature_var;
    nrf_crypto_ecc_private_key_t * p_key;
    nrf_crypto_ecdsa_signature_t   signature;
    size_t                         size;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 4);

    p_prv_var     = cli_input_arg_get(1, &m_ecc_private_key_type);
    p_message_var = cli_input_arg_get(2, &g_raw_type);
    CLI_CHECK((p_prv_var != NULL) && (p_message_var != NULL));

    p_key = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_prv_var);

    size = sizeof(signature);
    ret  = nrf_crypto_eddsa_sign(NULL,
                                 p_key,
                                 VAR_DATA(p_message_var),
                                 p_message_var->data_size,
                                 signature,
                                 &size);
    CLI_ERROR_CHECK(ret);

    p_signature_var = cli_output_arg_get(3, &g_raw_type, size);
    CLI_CHECK(p_signature_var != NULL);

    memcpy(VAR_DATA(p_signature_var), signature, size);

    return true;
}


CLI_CMD_REGISTER(eddsa_sign, &m_subcmd_var_var, cmd_eddsa_sign,
    "Sign a message with ECC private key using EdDSA.\r\n"
    "Usage:\r\n"
    "  ecdsa_sign private_key message signature\r\n"
    "Arguments:\r\n"
    "  IN  private_key  Private key\r\n"
    "  IN  message      Message to sign\r\n"
    "  OUT signature    Signature to create\r\n"
    );


/** @brief Command to verify with EdDSA. See command help for details.
 */
static bool cmd_eddsa_verify(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                    ret;
    var_t                       * p_pub_var;
    var_t                       * p_hash_var;
    var_t                       * p_signature_var;
    nrf_crypto_ecc_public_key_t * p_key;

    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(argv);

    CLI_ARGS_CHECK(argc == 4);

