mafaneh/ble-ebook-project/nRF5_SDK_current/examples/crypto/nrf_crypto/cli/cmd_ecc.c
    p_pub_var       = cli_input_arg_get(1, &m_ecc_public_key_type);
    p_hash_var      = cli_input_arg_get(2, &g_raw_type);
    p_signature_var = cli_input_arg_get(3, &g_raw_type);
    CLI_CHECK((p_pub_var != NULL) && (p_hash_var != NULL) && (p_signature_var != NULL));

    p_key = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_pub_var);

    ret = nrf_crypto_eddsa_verify(NULL,
                                  p_key,
                                  VAR_DATA(p_hash_var),
                                  p_hash_var->data_size,
                                  VAR_DATA(p_signature_var),
                                  p_signature_var->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(eddsa_verify, &m_subcmd_var_var_var, cmd_eddsa_verify,
    "Verify a hash with ECC public key using EdDSA.\r\n"
    "Usage:\r\n"
    "  ecdsa_verify public_key message signature\r\n"
    "Arguments:\r\n"
    "  IN  public_key   Public key\r\n"
    "  IN  message      Message to verify\r\n"
    "  IN  signature    Signature to check\r\n"
    );


/* =============================================================================================
 *                                   Utility ECC Commands
 * =============================================================================================
 */


/** @brief Command to invert byte order of a raw ECC data. See command help for details.
 */
static bool cmd_ecc_byte_order_invert(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t                           ret;
    var_t                              * p_in_var;
    var_t                              * p_out_var;
    nrf_crypto_ecc_curve_info_t  const * p_info;
    int                                  vars_first;

    UNUSED_PARAMETER(p_cli);

    CLI_ARGS_CHECK(argc == 3 || argc == 4);

    if (argc == 3)
    {
        p_info = NULL;
        vars_first = 1;
    }
    else
    {
        p_info = curve_info_get(argv[1]);
        CLI_CHECK(p_info != NULL);
        vars_first = 2;
    }

    p_in_var = cli_input_arg_get(vars_first, &g_raw_type);
    CLI_CHECK(p_in_var != NULL);
    p_out_var = cli_output_arg_get(vars_first + 1, &g_raw_type, p_in_var->data_size);
    CLI_CHECK(p_out_var != NULL);

    ret = nrf_crypto_ecc_byte_order_invert(p_info,
                                           VAR_DATA(p_in_var),
                                           VAR_DATA(p_out_var),
                                           p_in_var->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


CLI_CMD_REGISTER(ecc_byte_order_invert, &m_subcmd_curve_var_var, cmd_ecc_byte_order_invert,
    "Invert byte order of a raw ECC data.\r\n"
    "Usage:\r\n"
    "  ecc_byte_order_invert [curve] input output\r\n"
    "Arguments:\r\n"
    "  IN  curve   Optional curve that defines how to invert fields.\r\n"
    "              If it is skipped all bytes are inverted.\r\n"
    "  IN  input   Source raw data.\r\n"
    "  OUT output  Raw data containing inverted byte order.\r\n"
    );


/* =============================================================================================
 *                               ECC Key converters
 * =============================================================================================
 */


/** @brief Converter from public key to raw data. @see cli_conversion_fn_t.
 */
static bool public_to_raw_conv(struct cli_converter_s const * p_converter,
                               var_t                        * p_input,
                               var_t                       ** pp_output)
{
    ret_code_t                      ret;
    nrf_crypto_ecc_raw_public_key_t raw;
    size_t                          size;
    nrf_crypto_ecc_public_key_t   * p_key = (nrf_crypto_ecc_public_key_t *)VAR_DATA(p_input);

    UNUSED_PARAMETER(p_converter);

    size = sizeof(raw);
    ret = nrf_crypto_ecc_public_key_to_raw(p_key, raw, &size);
    CLI_ERROR_CHECK(ret);

    *pp_output = var_temp_create(&g_raw_type, size, true);
    CLI_CHECK(*pp_output != NULL);

    memcpy(VAR_DATA(*pp_output), raw, size);

    return true;
}


/*lint -esym(528,public_to_raw) */

CLI_CONVERTER_REGISTER(public_to_raw,
                 "raw",
                 &m_ecc_public_key_type,
                 &g_raw_type,
                 public_to_raw_conv,
                 NULL,
                 0);


/** @brief Converter from private key to raw data. @see cli_conversion_fn_t.
 */
static bool private_to_raw_conv(struct cli_converter_s const * p_converter,
                                var_t                        * p_input,
                                var_t                       ** pp_output)
{
    ret_code_t                       ret;
    nrf_crypto_ecc_raw_private_key_t raw;
    size_t                           size;
    nrf_crypto_ecc_private_key_t   * p_key = (nrf_crypto_ecc_private_key_t *)VAR_DATA(p_input);

    UNUSED_PARAMETER(p_converter);

    size = sizeof(raw);
    ret = nrf_crypto_ecc_private_key_to_raw(p_key, raw, &size);
    CLI_ERROR_CHECK(ret);

    *pp_output = var_temp_create(&g_raw_type, size, true);
    CLI_CHECK(*pp_output != NULL);

    memcpy(VAR_DATA(*pp_output), raw, size);

    return true;
}


/*lint -esym(528,private_to_raw) */

CLI_CONVERTER_REGISTER(private_to_raw,
                 "raw",
                 &m_ecc_private_key_type,
                 &g_raw_type,
                 private_to_raw_conv,
                 NULL,
                 0);


/** @brief Converter from raw data to private key. @see cli_conversion_fn_t.
 */
static bool raw_to_private_conv(struct cli_converter_s const * p_converter,
                                var_t                        * p_input,
                                var_t                       ** pp_output)
{
    ret_code_t ret;
    nrf_crypto_ecc_curve_info_t const * p_info =
        (nrf_crypto_ecc_curve_info_t const *)p_converter->p_tag;

    *pp_output = var_temp_create(&m_ecc_private_key_type, p_info->private_key_size, true);
    CLI_CHECK(*pp_output);

