mafaneh/ble-ebook-project/nRF5_SDK_current/examples/crypto/nrf_crypto/cli/cmd_ecc.c
    nrf_crypto_ecc_private_key_t * p_key = (nrf_crypto_ecc_private_key_t *)VAR_DATA(*pp_output);

    ret = nrf_crypto_ecc_private_key_from_raw(p_info, p_key, VAR_DATA(p_input), p_input->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


/** @brief Checks if conversion from raw data to private key is possible. @see cli_conversion_test_fn_t.
 */
static bool raw_to_private_test(struct cli_converter_s const * p_converter,
                                var_t                        * p_input,
                                var_type_t            const ** pp_type)
{
    nrf_crypto_ecc_curve_info_t * p_info = (nrf_crypto_ecc_curve_info_t *)p_converter->p_tag;
    if (p_input->data_size != p_info->raw_private_key_size)
    {
        return false;
    }
    return true;
}


/** @brief Converter from raw data to public key. @see cli_conversion_fn_t.
 */
static bool raw_to_public_conv(struct cli_converter_s const * p_converter,
                               var_t                        * p_input,
                               var_t                       ** pp_output)
{
    ret_code_t ret;
    nrf_crypto_ecc_curve_info_t const * p_info =
        (nrf_crypto_ecc_curve_info_t const *)p_converter->p_tag;

    *pp_output = var_temp_create(&m_ecc_public_key_type, p_info->public_key_size, true);
    CLI_CHECK(*pp_output);

    nrf_crypto_ecc_public_key_t * p_key = (nrf_crypto_ecc_public_key_t *)VAR_DATA(*pp_output);

    ret = nrf_crypto_ecc_public_key_from_raw(p_info, p_key, VAR_DATA(p_input), p_input->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


/** @brief Checks if conversion from raw data to public key is possible. @see cli_conversion_test_fn_t.
 */
static bool raw_to_public_test(struct cli_converter_s const * p_converter,
                               var_t                        * p_input,
                               var_type_t            const ** pp_type)
{
    nrf_crypto_ecc_curve_info_t * p_info = (nrf_crypto_ecc_curve_info_t *)p_converter->p_tag;
    if (p_input->data_size != p_info->raw_public_key_size)
    {
        return false;
    }
    return true;
}


/** @brief Converter that inverts byte order in ecc raw data. @see cli_conversion_fn_t.
 */
static bool ecc_byte_invert_conv(struct cli_converter_s const * p_converter,
                                 var_t                        * p_input,
                                 var_t                       ** pp_output)
{
    ret_code_t ret;
    nrf_crypto_ecc_curve_info_t const * p_info =
        (nrf_crypto_ecc_curve_info_t const *)p_converter->p_tag;

    *pp_output = var_temp_create(&g_raw_type, p_input->data_size, true);
    CLI_CHECK(*pp_output);

    ret = nrf_crypto_ecc_byte_order_invert(p_info,
                                           VAR_DATA(p_input),
                                           VAR_DATA(*pp_output),
                                           p_input->data_size);
    CLI_ERROR_CHECK(ret);

    return true;
}


/** @brief Checks if specific curve supports inverting byte order in provided ecc raw data. @see cli_conversion_fn_t.
 */
static bool ecc_byte_invert_test(struct cli_converter_s const * p_converter,
                                 var_t                        * p_input,
                                 var_type_t            const ** pp_type)
{
    nrf_crypto_ecc_curve_info_t * p_info = (nrf_crypto_ecc_curve_info_t *)p_converter->p_tag;
    if ((p_info != NULL) && (p_input->data_size % p_info->raw_private_key_size != 0))
    {
        return false;
    }
    return true;
}


/*lint -esym(528,raw_to_private_*) */
/*lint -esym(528,raw_to_public_*) */
/*lint -esym(528,ecc_byte_invert_*) */

#if NRF_CRYPTO_ECC_BP256R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_bp256r1,
                 "private_bp256r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_bp256r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_bp256r1,
                 "public_bp256r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_bp256r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_bp256r1,
                 "invert_bp256r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_bp256r1_curve_info);
#endif

#if NRF_CRYPTO_ECC_BP384R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_bp384r1,
                 "private_bp384r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_bp384r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_bp384r1,
                 "public_bp384r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_bp384r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_bp384r1,
                 "invert_bp384r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_bp384r1_curve_info);
#endif

#if NRF_CRYPTO_ECC_BP512R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_bp512r1,
                 "private_bp512r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_bp512r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_bp512r1,
                 "public_bp512r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_bp512r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_bp512r1,
                 "invert_bp512r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_bp512r1_curve_info);
#endif

