mafaneh/ble-ebook-project/nRF5_SDK_current/examples/crypto/nrf_crypto/cli/cmd_ecc.c
#if NRF_CRYPTO_ECC_CURVE25519_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_curve25519,
                 "private_curve25519",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_curve25519_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_curve25519,
                 "public_curve25519",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_curve25519_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_curve25519,
                 "invert_curve25519",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_curve25519_curve_info);
#endif

#if NRF_CRYPTO_ECC_ED25519_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_ed25519,
                 "private_ed25519",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_ed25519_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_ed25519,
                 "public_ed25519",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_ed25519_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_ed25519,
                 "invert_ed25519",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_ed25519_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP160K1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp160k1,
                 "private_secp160k1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp160k1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp160k1,
                 "public_secp160k1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp160k1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp160k1,
                 "invert_secp160k1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp160k1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP160R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp160r1,
                 "private_secp160r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp160r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp160r1,
                 "public_secp160r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp160r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp160r1,
                 "invert_secp160r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp160r1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP160R2_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp160r2,
                 "private_secp160r2",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp160r2_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp160r2,
                 "public_secp160r2",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp160r2_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp160r2,
                 "invert_secp160r2",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp160r2_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP192K1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp192k1,
                 "private_secp192k1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp192k1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp192k1,
                 "public_secp192k1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp192k1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp192k1,
                 "invert_secp192k1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp192k1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP192R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp192r1,
                 "private_secp192r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp192r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp192r1,
                 "public_secp192r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp192r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp192r1,
                 "invert_secp192r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp192r1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP224K1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp224k1,
                 "private_secp224k1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp224k1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp224k1,
                 "public_secp224k1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp224k1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp224k1,
                 "invert_secp224k1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp224k1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP224R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp224r1,
                 "private_secp224r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp224r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp224r1,
                 "public_secp224r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp224r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp224r1,
                 "invert_secp224r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp224r1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP256K1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp256k1,
                 "private_secp256k1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp256k1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp256k1,
                 "public_secp256k1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp256k1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp256k1,
                 "invert_secp256k1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp256k1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP256R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp256r1,
                 "private_secp256r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp256r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp256r1,
                 "public_secp256r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp256r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp256r1,
                 "invert_secp256r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp256r1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP384R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp384r1,
                 "private_secp384r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp384r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp384r1,
                 "public_secp384r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp384r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp384r1,
                 "invert_secp384r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp384r1_curve_info);
#endif

#if NRF_CRYPTO_ECC_SECP521R1_ENABLED
CLI_CONVERTER_REGISTER(raw_to_private_secp521r1,
                 "private_secp521r1",
                 &g_raw_type,
                 &m_ecc_private_key_type,
                 raw_to_private_conv,
                 raw_to_private_test,
                 (void *)&g_nrf_crypto_ecc_secp521r1_curve_info);
CLI_CONVERTER_REGISTER(raw_to_public_secp521r1,
                 "public_secp521r1",
                 &g_raw_type,
                 &m_ecc_public_key_type,
                 raw_to_public_conv,
                 raw_to_public_test,
                 (void *)&g_nrf_crypto_ecc_secp521r1_curve_info);
CLI_CONVERTER_REGISTER(ecc_byte_invert_secp521r1,
                 "invert_secp521r1",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 (void *)&g_nrf_crypto_ecc_secp521r1_curve_info);
#endif

CLI_CONVERTER_REGISTER(ecc_byte_invert_generic,
                 "invert",
                 &g_raw_type,
                 &g_raw_type,
                 ecc_byte_invert_conv,
                 ecc_byte_invert_test,
                 NULL);
